cask_args appdir: '/Applications'
tap "neovim/neovim"
tap "homebrew/cask-versions"
tap "homebrew/cask-fonts"

brew "neovim"
brew "git"
brew "bat"
brew "fzf"
brew "jq"
brew "direnv"
brew "exa"
brew "fish"
brew "pidof"
brew "minikube"
brew "openssl"
brew "starship"
brew "ripgrep"
brew "broot"
brew "reattach-to-user-namespace"
brew "rg"
brew "tmux"
brew "z"
brew "nnn"
brew "imagemagick"
brew "htop"
brew "fasd"
brew "python3"
brew "readline"
brew "redis"
brew "python3"
brew "xtail"
brew "httpie"
brew "pinentry-mac"
brew "postgresql"
brew "overmind"
brew "telnet"
brew "wget"
brew "font-juliamono"

brew "libyaml" # should come after openssl

brew "dfu-util"
brew "dfu-programmer"

cask "docker"
cask "appcleaner"
cask "visual-studio-code"
cask "vnc-viewer"
cask "hocus-focus"
cask "tableplus"
cask "skim"
cask "iina"
cask "marked"
cask "beamer"
cask "amethyst"
cask "folx"
cask "dash"
cask "paw"
cask "vanilla"
cask "teensy"
cask "karabiner-elements"
cask "alfred"
cask "keybase"
cask "kitty"
cask "chromedriver"
cask "gpg-suite-pinentry"
cask "microsoft-edge-dev"
cask "netnewswire"
cask "pock"
cask "tunnelblick"
cask "radio-silence"

cask "google-chrome"
cask "firefox-developer-edition"
