cask_args appdir: '/Applications'
tap "neovim/neovim"
tap "caskroom/versions"
tap "universal-ctags/universal-ctags"

brew "git"
brew "direnv"
brew "openssl"
brew "reattach-to-user-namespace"
brew "the_silver_searcher"
brew "tmux"
brew "zsh"
brew "z"
brew "unison"
brew "ranger"
brew "neovim"
brew "heroku-toolbelt"
brew "hub"
brew "imagemagick"
brew "htop"
brew "fasd"
brew "python3"
brew "heroku"
brew "readline"
brew "redis"
brew "postgresql"
brew "python3"
brew "xtail"
brew "chromedriver"
brew "gpg-agent"
brew "httpie"
brew "yarn"
brew "phantomjs"
brew "pinentry-mac"


brew "libyaml" # should come after openssl
brew "chruby"
brew "nodenv"
brew "ruby-install"
brew "node-build"

brew "dfu-util"
brew "dfu-programmer"

cask "docker-edge"
cask "appcleaner"
cask "visual-studio-code"
cask "hocus-focus"
cask "iterm2-nightly"
cask "tableplus"
cask "shiftit"
cask "sidestep"
cask "skim"
cask "iina"
cask "tunnelbear"
cask "transmission"
cask "omnifocus"
cask "marked"
cask "beamer"
cask "cloudapp"
cask "dash"
cask "paw"
cask "spotify"
cask "vanilla"
cask "teensy"
cask "karabiner-elements"
cask "alfred"
cask "slack-beta"
cask "keybase"
cask "riot"

cask "chromium"
cask "google-chrome-canary"
cask "google-chrome-dev"
cask "opera"
cask "firefoxdeveloperedition"
